In [1]:
import pandas as pd

In [30]:
df=pd.read_csv("Titanic_data.csv")

In [32]:
df.shape

(891, 12)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [34]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Identify is there null values

In [36]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [38]:
df.drop(["PassengerId","Name","Cabin","Ticket","Fare","Age"],axis=1,inplace=True)

In [40]:
df.shape

(891, 6)

In [10]:
df.head(20)

    Survived  Pclass     Sex  SibSp  Parch Embarked
0          0       3    male      1      0        S
1          1       1  female      1      0        C
2          1       3  female      0      0        S
3          1       1  female      1      0        S
4          0       3    male      0      0        S
5          0       3    male      0      0        Q
6          0       1    male      0      0        S
7          0       3    male      3      1        S
8          1       3  female      0      2        S
9          1       2  female      1      0        C
10         1       3  female      1      1        S
11         1       1  female      0      0        S
12         0       3    male      0      0        S
13         0       3    male      1      5        S
14         0       3  female      0      0        S
15         1       2  female      0      0        S
16         0       3    male      4      1        Q
17         1       2    male      0      0        S
18         0       3  female      1      0        S
19         1       3  female      0      0        C

In [11]:
#Replace NaN by mean
#mean_value=df["Age"].mean()
#df["Age"].fillna(value=mean_value, inplace=True)
#mode_value=df["Embarked"].mode()[0]
#df["Embarked"].fillna(mode_value, inplace=True)

C:\Users\MVSR\AppData\Local\Temp\ipykernel_5956\2037941417.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Embarked"].fillna(mode_value, inplace=True)

In [42]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
SibSp       0
Parch       0
Embarked    2
dtype: int64

In [44]:
df["Sex"].replace(['female','male'],[0,1],inplace=True)
df["Embarked"].replace(['S','C','Q'],[0,1,2],inplace=True)

In [14]:
df

     Survived  Pclass  Sex  SibSp  Parch  Embarked
0           0       3    1      1      0         0
1           1       1    0      1      0         1
2           1       3    0      0      0         0
3           1       1    0      1      0         0
4           0       3    1      0      0         0
..        ...     ...  ...    ...    ...       ...
886         0       2    1      0      0         0
887         1       1    0      0      0         0
888         0       3    0      1      2         0
889         1       1    1      0      0         1
890         0       3    1      0      0         2

[891 rows x 6 columns]

In [46]:
import warnings
warnings.filterwarnings("ignore")